RSN/src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>СерверПриложений</name>
    <type>
      <types>CatalogRef.СерверПриложений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьНаВебСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>EnumRef.КонфигурацииИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>Тестовая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Среда</name>
    <type>
      <types>EnumRef.Среда</types>
    </type>
  </attributes>
  <attributes>
    <name>Контур</name>
    <type>
      <types>CatalogRef.Контур</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаДанных</name>
    <type>
      <types>CatalogRef.БазыДанных</types>
    </type>
  </attributes>
</mdclass:Catalog>

RSN/src/Catalogs/ИнформационныеБазы/Forms/ФормаПодбораИБКонфигурация/Module.bsl
#Область ОбработчикиСобытийФормы
  
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("БезТестовых") и Параметры.БезТестовых Тогда 
		ВидТестовой = 1;
		ЕстьОтбор 	= Истина;
	КонецЕсли;
	Кластеры = ИБПолное.ПолучитьЭлементы();
	ОтборОрганизация.Очистить();
	//Кластеры = ИБ.ПолучитьЭлементы();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнформационныеБазы.Ссылка КАК База,
		|	ИнформационныеБазы.Конфигурация КАК СерверПриложений,
		|	ПРЕДСТАВЛЕНИЕ(ИнформационныеБазы.Конфигурация) КАК Конфигурация,
		|	ИнформационныеБазы.Тестовая КАК Тестовая,
		|	ЛОЖЬ КАК Подобрать,
		|	ИнформационныеБазы.Организация КАК Организация
		|ИЗ
		|	Справочник.ИнформационныеБазы КАК ИнформационныеБазы
		|
		|УПОРЯДОЧИТЬ ПО
		|	СерверПриложений,
		|	ИнформационныеБазы.Наименование
		|ИТОГИ ПО
		|	СерверПриложений";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКластеры = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);  
	Пока ВыборкаКластеры.Следующий() Цикл 
		
		НовыйКластер = Кластеры.Добавить();
		НовыйКластер.Подобрать 	= Ложь;
		НовыйКластер.База 		= ВыборкаКластеры.СерверПриложений;   
		
		Базы = НовыйКластер.ПолучитьЭлементы();
		
		Выборка = ВыборкаКластеры.Выбрать();
		Пока Выборка.Следующий() Цикл 
			
			База = Базы.Добавить();	
			ЗаполнитьЗначенияСвойств(База, Выборка);
			Если ЗначениеЗаполнено(Выборка.Организация) Тогда
				ОтборОрганизация.Добавить(Выборка.Организация);
			КонецЕсли;
			//База.Подобрать = Ложь;
			//База.База = Выборка.Ссылка; 
		КонецЦикла;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ОтборОрганизация" ,"Видимость" , ОтборОрганизация.Количество() > 0);	
	//Элементы.ОтборОрганизация.СписокВыбора = ОтборОрганизация;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидТестовойПриИзменении(Элемент)
	ОбновитьДерево();
КонецПроцедуры


&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	ОбновитьДерево();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Результат = Новый Массив;
	
	Кластеры = ИБ.ПолучитьЭлементы();
	Для Каждого Кластер ИЗ Кластеры Цикл
		Базы = Кластер.ПолучитьЭлементы();
		Для Каждого Стр Из Базы Цикл
			Если Стр.Подобрать	Тогда
				Результат.Добавить(Стр.База);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	ОбработатьФлажки(Истина);
КонецПроцедуры 

&НаКлиенте
Процедура СнятьФлажки(Команда)
	ОбработатьФлажки(Ложь);
КонецПроцедуры
             
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура ИБПодобратьПриИзменении(Элемент)
	
	ТекДанные = Элементы.ИБ.ТекущиеДанные;  
	Базы = ТекДанные.ПолучитьЭлементы();
	Для Каждого Стр Из Базы Цикл
		Стр.Подобрать = ТекДанные.Подобрать;	
	КонецЦикла;
	
КонецПроцедуры 

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьФлажки(Установить)
	
	Кластеры = ИБ.ПолучитьЭлементы();
	Для Каждого Кластер ИЗ Кластеры Цикл
		Кластер.Подобрать = Установить;
		Базы = Кластер.ПолучитьЭлементы();
		Для Каждого База Из Базы Цикл
			База.Подобрать = Установить;	
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры 

&НаКлиенте
Процедура Бухгалтерия(Команда)
	Элементы.ИББухгалтерия.Пометка = Не Элементы.ИББухгалтерия.Пометка; 
	ОбновитьДерево();
КонецПроцедуры

&НаКлиенте
Процедура Тестовые(Команда)
	Элементы.ИБТестовые.Пометка = Не Элементы.ИБТестовые.Пометка; 
	ОбновитьДерево();
КонецПроцедуры

&НаКлиенте
Процедура БезТестовых(Команда)
	Элементы.ИББезТестовых.Пометка = Не Элементы.ИББезТестовых.Пометка; 
	ОбновитьДерево();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьДерево();
КонецПроцедуры

&НаКлиенте
Функция ПроверитьОтбор(ГруппаПроверки)
	Ответ = Ложь; 
	Если ТипЗнч(ГруппаПроверки) = Тип("ГруппаФормы") Тогда 
		Для Каждого Эл Из ГруппаПроверки.ПодчиненныеЭлементы Цикл  
			Если Эл.Пометка Тогда 
				Ответ = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции

&НаКлиенте
Процедура ОбновитьДерево()
	ОтборТест = ВидТестовой = 0 = Ложь;//ПроверитьОтбор(Элементы.ВидБазы);//Элементы.ИББезТестовых.Пометка или Элементы.ИБТестовые;
	МассивОрг = ОбщегоНазначенияКлиентСервер.ОтмеченныеЭлементы(ОтборОрганизация);
	ОтборОрг = МассивОрг.Количество() > 0 и массивОрг.Количество() <> ОтборОрганизация.Количество();
	//ОтборКонф = ПроверитьОтбор(Элементы.Конфигурация);    
	ЕстьОтбор = ОтборТест Или ОтборОрг;
	Заголовок = "Выберите базы" + ?(ЕстьОтбор, ", (установлен отбор)", "");
	
	ИБ.ПолучитьЭлементы().Очистить();
	Кластеры = ИБ.ПолучитьЭлементы();
	
	Для Каждого КластерД Из ИБПолное.ПолучитьЭлементы() Цикл  
		НовыйКластер = Кластеры.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйКластер, КластерД);    
		
		НовыеПодчиненные = НовыйКластер.ПолучитьЭлементы();
		Для каждого Подчиненные из  КластерД.ПолучитьЭлементы() Цикл  
			Если ОтборТест Тогда  
				Если (ВидТестовой = 1 и не Подчиненные.Тестовая) 
					или (ВидТестовой = 2 и Подчиненные.Тестовая) Тогда 
				Иначе 
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			Если ОтборОрг Тогда
				Если МассивОрг.Найти(Подчиненные.Организация) = Неопределено Тогда 
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
//			Если ОтборКонф Тогда      
//				Если Не ЗначениеЗаполнено(Подчиненные.Конфигурация) Тогда 
//					Продолжить;
//				КонецЕсли;
//				Проверка = Элементы.Конфигурация.ПодчиненныеЭлементы.Найти(Подчиненные.Конфигурация);
//				Если Проверка = Неопределено = Ложь Тогда 
//					Если Проверка.Пометка Тогда 
//					Иначе 
//						Продолжить;
//					КонецЕсли; 
//				КонецЕсли;
//				
//			КонецЕсли; 
			НовыйПодчиненный = НовыеПодчиненные.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйПодчиненный, Подчиненные);
		КонецЦикла;
		Если НовыеПодчиненные.Количество() = 0 Тогда 
			Кластеры.Удалить(НовыйКластер);
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтборОрганизация.ПоказатьОтметкуЭлементов(Новый ОписаниеОповещения("ОтборОрганизацияНачалоВыбораЗавершение", ЭтотОбъект), "Установите отбор");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияНачалоВыбораЗавершение(Список, ДополнительныеПараметры) Экспорт
	
	Если Список <> Неопределено Тогда 
		ОбновитьДерево();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
